app/controllers/phonebooks_controller.rb

SELECT "phonebooks".* FROM "phonebooks"
SELECT "phonebooks".* FROM "phonebooks" WHERE "phonebooks"."user_id" = ? ORDER BY "phonebooks"."created_at" DESC  [["user_id", 1]]
---
    def index
        @roles = User.roles

        if current_user.role == "admin"
            @phonebook = Phonebook.all
        else
            @phonebook = Phonebook.where(user_id: current_user.id).order(created_at: :desc)

SELECT  "phonebooks".* FROM "phonebooks" WHERE "phonebooks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def edit
        @phonebook = Phonebook.find(params[:id])

INSERT INTO "phonebooks" ("user_id", "name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "asdadsadas"], ["number", "aadada"], ["created_at", "2018-08-01 03:35:44.734903"], ["updated_at", "2018-08-01 03:35:44.734903"]]
---
    def create
        @phonebook = Phonebook.new(phonebook_params)

        respond_to do |format|
            @errorName = []
            @errorNumber = []
            if @phonebook.save

SELECT  "phonebooks".* FROM "phonebooks" WHERE "phonebooks"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
UPDATE "phonebooks" SET "name" = ?, "updated_at" = ? WHERE "phonebooks"."id" = ?  [["name", "Budi"], ["updated_at", "2018-08-02 07:20:51.923775"], ["id", 45]]
SELECT  "phonebooks".* FROM "phonebooks" WHERE "phonebooks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "phonebooks" SET "number" = ?, "updated_at" = ? WHERE "phonebooks"."id" = ?  [["number", "12345678901"], ["updated_at", "2018-08-03 04:57:16.917272"], ["id", 45]]
---
    def update
        @phonebook = Phonebook.find(params[:id])

        respond_to do |format|
            @errorName = []
            @errorNumber = []
            if @phonebook.update(phonebook_params)
                format.js
                redirect_to phonebooks_path
            else
                format.js
                @phonebook.errors.any?
                if (@phonebook.errors["name"] != nil)
                    @errorName.push(@phonebook.errors["name"][0])

SELECT  "phonebooks".* FROM "phonebooks" WHERE "phonebooks"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @phonebook = Phonebook.find(params[:id])

SELECT  "phonebooks".* FROM "phonebooks" WHERE "phonebooks"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
DELETE FROM "phonebooks" WHERE "phonebooks"."id" = ?  [["id", 45]]
---
    def destroy
        @phonebook = Phonebook.find(params[:id])
        @phonebook.destroy